Revit 2021.1 API
EditScope Members
The EditScope type exposes the following members.
Methods
Name | Description
Cancel
 Cancels the edit scope.
Commit
 Finishes the edit scope.
Dispose
Releases all resources used by the EditScope
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsActive
 Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EditScope Class
Autodesk.Revit.DB Namespace